src/Cases/buoyantBoussinesqSIMPLE-Scalar-LADSource-Temp/system/turbulenceFields
// -*- C++ -*-

type            turbulenceFields;
libs            (fieldFunctionObjects);
field           R;
writeControl    writeTime;


// *********************************************************************** //
